/**
 * ১. ডেটা কনভার্টার (Bytes to MB/GB)
 *
 * আমরা যখন ইন্টারনেট ব্যবহার করি, ডেটা সাধারণত বাইট বা মেগাবাইটে হিসাব করা হয়।
 *
 * একটি ফাংশন লিখুন যা ইনপুট হিসেবে মেগাবাইট (MB) গ্রহণ করবে।
 * ফাংশনটি সেটিকে গিগাবাইটে (GB) কনভার্ট করে রিটার্ন করবে।
 * (সূত্র: ১০২৪ মেগাবাইট = ১ গিগাবাইট)। আউটপুটটি দশমিকের পর নির্দিষ্ট ঘর পর্যন্ত (যেমন ২ ঘর) দেখাতে পারলে ভালো।
 */

function convertMbToGb(mb) {
  return `${mb} mb = ${(mb / 1024).toFixed(2)} gb.`;
}

const mbValue = 6000;
const gbValue = convertMbToGb(mbValue);
console.log(gbValue);
