/**
 * Task 1: FizzBuzz (ফিজনবাজ)
 *
 * ১ থেকে ১০০ পর্যন্ত সংখ্যাগুলো কনসোলে প্রিন্ট করতে হবে। কিন্তু শর্ত হলো:
 *
 * যে সংখ্যাগুলো ৩ দিয়ে নিঃশেষে ভাগ করা যায়, সেগুলোর বদলে প্রিন্ট করবেন "Fizz"।
 * যে সংখ্যাগুলো ৫ দিয়ে নিঃশেষে ভাগ করা যায়, সেগুলোর বদলে প্রিন্ট করবেন "Buzz"।
 * আর যে সংখ্যাগুলো ৩ এবং ৫ উভয় সংখ্যা দিয়েই ভাগ করা যায়, সেগুলোর বদলে প্রিন্ট করবেন "FizzBuzz"।
 */

for (let i = 1; i <= 100; i++) {
  if (i % 3 === 0 && i % 5 === 0) {
    console.log("FizzBuzz");
  } else if (i % 5 === 0) {
    console.log("Buzz");
  } else if (i % 3 === 0) {
    console.log("Fizz");
  } else {
    console.log(`generale number: ${i}`);
  }
}
